{
  "recipeID": 42,
    "title": "Chicken Kiev",
    "slug": "chicken-kiev",
    "description": "Look back into Soviet Union times",
    "story": "This is another recipe from my childhood. Now it is my husband's one of the most favorite dishes. I usually make more and freeze. <br /><br /> My personal improvement to the classic recipe - pesto. Before adding butter I just spread some homemade pesto onto the chicken. I serve it with mashed potatoes (half regular and half sweet) and grated carrots with dried prunes and walnuts",
    "category": "after-work",
    "recipeURL": "#/recipes/chicken-kiev",
    "imageURL": "images/recipes/chicken-kiev.jpg",
    "creationDate": "2019-12-16",
    "lastModified": "2019-12-16",
    "servings": 8,
    "cookingTime": 60,
    "ingredients": [
    {
      "name": "chicken breasts",
      "quantity": 4,
      "unit": null,
      "preparationNotes": "sliced in half (or 8 chicken cutlets)"
    },
    {
      "name": "butter",
      "quantity": 115,
      "unit": "g",
      "preparationNotes": "one stick (very cold)"
    },
    {
      "name": "pesto",
      "quantity": 8,
      "unit": "tsp",
      "preparationNotes": null
    },
    {
      "name": "white bread",
      "quantity": 12,
      "unit": "slices",
      "preparationNotes": "(Sourdough works very well)"
    },
    {
      "name": "eggs",
      "quantity": 6,
      "unit": null,
      "preparationNotes": null
    },
    {
      "name": "flour",
      "quantity": 4,
      "unit": "tbsp",
      "preparationNotes": null
    },
    {
      "name": "salt and pepper",
      "quantity": null,
      "unit": null,
      "preparationNotes": null
    },
    {
      "name": "canola oil",
      "quantity": 1,
      "unit": "l",
      "preparationNotes": null
    }
  ],
  "instructions": [
    "Cut butter in 8 rectangles. Put into the freezer for now.",
    "Process bread in the food processor to make fine bread crumbs.",
    "Prepare 3 deep plates: one with flour, another with eggs lightly beaten, third with bread crumbs.",
    "Cut chicken breasts in half. Pat to make thin cutlets (aim for 3 mm or so, try not to tear the meat).",
    "Season each cutlet with salt and pepper.",
    "Spread a teaspoon of pesto on the cutlet. Put butter in the middle and wrap chicken around the butter. Try avoid leaving holes.",
    "Put chicken in freezer or fridge to set for 30 minutes, it will be easier to coat and form once it is a little bit firmer.",
    "Coat in flour first, then eggs, bread crumbs after that. Repeat egg coating and then bread coating.",
    "At this point we are ready to cook or freeze.",
    "For cooking preheat the oven to 350F.",
    "Preheat canola oil in a deep pan (so that chicken would be covered in oil) to 350 F. Place chicken into hot oil. Fry for 5-7 minutes.",
    "Bake for 10-12 minutes.",
    "Serve with mashed potatoes or french fries."
  ]
}